stressTesting/yelp.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 15
      arrivalRate: 1000
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/api/restaurants/{{$randomNumber(1, 10000000)}}"
    - post:
        url: "/api/reviews/{{$randomNumber(1, 10000000)}}"